---
kind: method
id: M:Autodesk.Revit.UI.SelectionUIOptions.Dispose
source: html/7c1cf3fc-e79a-afca-b634-c9a0b89448d0.htm
---
# Autodesk.Revit.UI.SelectionUIOptions.Dispose Method

Releases all resources used by the SelectionUIOptions

## Syntax (C#)
```csharp
public void Dispose()
```